In [1]:
#Import dependencies
import pandas as pd

#Import modules
from sqlalchemy import create_engine

from flask import Flask
from flask_sqlalchemy import SQLAlchemy

In [2]:
#Load CSV files
clean_inspection = "../Resources/clean_inspection_df2.csv"
clean_income = "../Resources/clean_income_df2.csv"

In [3]:

#View inspection dataframe
clean_inspection_df = pd.read_csv(clean_inspection)
clean_inspection_df.head()

,DBA,BOROUGH,STREET,ZIPCODE,CUISINE DESCRIPTION,SCORE,GRADE
0,TENGRITAGH UYGHUR CUSINE,Manhattan,WEST 37 STREET,10018.0,Chinese,13.0,A
1,KORILLA,Brooklyn,METROTECH CTR,11201.0,Korean,9.0,A
2,FANTASY BAR AND RESTAURANT,Bronx,EAST TREMONT AVENUE,10453.0,Spanish,11.0,A
3,INTERNATIONAL CATERERS,Bronx,AMPERE AVENUE,10465.0,American,11.0,A
4,FRESH CITY DELI,Bronx,HUNTS POINT AVENUE,10459.0,American,65.0,N

In [4]:
#Rename columns
clean_inspection_df.rename(columns = {'CUISINE DESCRIPTION':'CUISINE_DESCRIPTION'}, inplace = True)

In [5]:
#View income dataframe
clean_income_df = pd.read_csv(clean_income)
clean_income_df.head()

  INCOME LEVEL                              DBA            STREET
0  high income            MARIACHI'S RESTAURANT   CHAMBERS STREET
1  high income            SPOTIFY - BARISTA BAR  GREENWICH STREET
2  high income  STARBUCKS COFFEE COMPANY #29854  GREENWICH STREET
3  high income                          CANTEEN   WORLD TRADE CTR
4  high income     JOE & THE JUICE GREENWICH ST  GREENWICH STREET

In [6]:
#Rename columns
clean_income_df.rename(columns = {'INCOME LEVEL':'INCOME_LEVEL'}, inplace = True)

In [7]:
#Create database engine
"postgresql://[user]:[password]@[location]:[port]/[database]"

'postgresql://[user]:[password]@[location]:[port]/[database]'

In [8]:
#Import password from config.py file
from config import db_password

In [9]:
#Connection string for local server
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/NYC_restaurants"

In [10]:
#Create database engine
engine = create_engine(db_string)

In [11]:
#Import inspection data
#clean_inspection_df.to_sql(name='inspection3', con=engine)

In [12]:
#Import income data
#clean_income_df.to_sql(name='income3', con=engine)

In [13]:
#Read database from postgreSQL into pandas dataframe
final_database_df = pd.read_sql_query('select * from "newtable5"',con=engine)

In [14]:
#View retrieved database
final_database_df

,DBA,STREET,INCOME_LEVEL,BOROUGH,ZIPCODE,CUISINE_DESCRIPTION,SCORE,GRADE
0,PATHOS,1 AVENUE,high income,Manhattan,10022,Mediterranean,9.0,A
1,THE LITTLE BEET,PARK AVENUE,high income,Manhattan,10017,Salads,13.0,A
2,AMAZE FUSION & LOUNGE,3 AVENUE,high income,Manhattan,10017,Asian/Asian Fusion,27.0,B
3,NOURISH THAI,VANDERBILT AVENUE,medium income,Brooklyn,11238,Thai,9.0,A
4,ESSEN,MADISON AVENUE,high income,Manhattan,10017,Sandwiches,13.0,A
...,...,...,...,...,...,...,...,...
8219,SOUTHSIDE CAFE (Produce Market),HUNTS POINT TERMINAL MARKET,low income,Bronx,10474,Latin American,9.0,A
8220,HOP KEE RESTAURANT,MOTT STREET,high income,Manhattan,10013,Chinese,12.0,A
8221,HALE & HEARTY SOUP,LEXINGTON AVENUE,high income,Manhattan,10017,Soups/Salads/Sandwiches,10.0,A
8222,DYNASTY TASTE LAM,EAST TREMONT AVENUE,low income,Bronx,10457,Chinese,7.0,A
8223,CARNATION BAKERY,KISSENA BOULEVARD,low income,Queens,11355,Bakery Products/Desserts,9.0,Z